In [17]:
import pandas as pd #pandas kütüphanesini pd kısaltmasıyla çağırdım. 
import numpy as np #numpy kütüphanesini np kısaltmasıyla çağırdım.

In [34]:
dataset = {"İsim": ["Mert", "Nilay", "Dogancan", "Omer", "Merve", "Onur"],
           "Soyad": ["Cobanov", "Mertal", "Mavideniz", "Cengiz", "Noyan", "Sahil"],
           "Yas":   [24, 22, 24, 23, "bilinmiyor", 23],
           "Sehir": ["Bursa", "Ankara", "Istanbul", np.nan, "Izmir", "Istanbul"],
           "Ulke":  ["Turkiye", "Turkiye", "Turkiye", "Turkiye", "Turkiye", "Turkiye"],
           "GANO":  [np.nan, np.nan, np.nan, np.nan, 3.90, np.nan]}

In [56]:
df = pd.DataFrame(dataset) #veriçerçevemi oluşturdum.

In [57]:
df #veri çerçeversini ekrana bastırdım.

       İsim      Soyad         Yas     Sehir     Ulke  GANO
0      Mert    Cobanov          24     Bursa  Turkiye   NaN
1     Nilay     Mertal          22    Ankara  Turkiye   NaN
2  Dogancan  Mavideniz          24  Istanbul  Turkiye   NaN
3      Omer     Cengiz          23       NaN  Turkiye   NaN
4     Merve      Noyan  bilinmiyor     Izmir  Turkiye   3.9
5      Onur      Sahil          23  Istanbul  Turkiye   NaN

In [10]:
"""
preprocessing işlemi yapacağımda ilk gördüğüm şey yaş kolonunda 'bilinmiyor'
yazısı olması

yine GANO daki 6 veriden sadece 1 tanesini biliyoruz.

"""

df.info()#kolonda kaç boş olmayan veri olduğunu ve bu kolondaki verilerin
#hangi veritipinde olduğunu görüyoruz.

#yas kolonunun object olmasının tek nedeni 5 değer integer veri iken
#1 verinin tipinin string olması bunu object olarak gösterir.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   İsim    6 non-null      object
 1   Soyad   6 non-null      object
 2   Yas     6 non-null      object
 3   Sehir   5 non-null      object
 4   Ulke    6 non-null      object
 5   GANO    1 non-null      float64
dtypes: float64(1), object(5)
memory usage: 416.0+ bytes

In [11]:
df.isna() #hangilerinin non value olduğu true olarak dönüyor

    İsim  Soyad    Yas  Sehir   Ulke   GANO
0  False  False  False  False  False   True
1  False  False  False  False  False   True
2  False  False  False  False  False   True
3  False  False  False   True  False   True
4  False  False  False  False  False  False
5  False  False  False  False  False   True

In [18]:
df.isna().sum() #kolonlarda teker teker kaçtane nan value var onu görüyoruz.

İsim     0
Soyad    0
Yas      0
Sehir    1
Ulke     0
GANO     5
dtype: int64

In [20]:
df.isna().sum().sum() #toplam kaçtane non value olduğunu görüyoruz.

6

In [21]:
df.dropna(axis = 1, how = "any", thresh = 3)

#düşürme işlemini satırdamı yoksa sütundamı yapacaksınız?
#how = 'any' 'all hepsi' = 'any' için o kolon veya o satır herhangi bir non value içeriyorsa düşürmüş
#oluyorsunuz
#thresh integer bir değer olarak o kolonu veya satırdaki non sayısı bu thresh değerinin üzerine çıkarsa düşürüyoruz.

       İsim      Soyad         Yas     Sehir     Ulke
0      Mert    Cobanov          24     Bursa  Turkiye
1     Nilay     Mertal          22    Ankara  Turkiye
2  Dogancan  Mavideniz          24  Istanbul  Turkiye
3      Omer     Cengiz          23       NaN  Turkiye
4     Merve      Noyan  bilinmiyor     Izmir  Turkiye
5      Onur      Sahil          23  Istanbul  Turkiye

In [ ]:
#böylece GANO kolonunda toplamda 5 non value olduğu için düştü
#fakat yas kolonunda tek non value olduğu için düşmedi.

In [23]:
df.drop(labels=["GANO"], axis=1)#spesifik olarak kolon düşürmek için
#df.drop(labels=["GANO", "Ulke"], axis=1, inplace=True)
#şeklinde söylersem GANO ve Ulke kolonlarını kaldırmış olurum ve inplace = True
#olduğundan df üzerine bu değişikliğim yazılmış olur.

       İsim      Soyad         Yas     Sehir     Ulke
0      Mert    Cobanov          24     Bursa  Turkiye
1     Nilay     Mertal          22    Ankara  Turkiye
2  Dogancan  Mavideniz          24  Istanbul  Turkiye
3      Omer     Cengiz          23       NaN  Turkiye
4     Merve      Noyan  bilinmiyor     Izmir  Turkiye
5      Onur      Sahil          23  Istanbul  Turkiye

In [58]:
df_2 = df.drop(labels = ['GANO', 'Ulke'], axis = 1)

In [59]:
df_2

       İsim      Soyad         Yas     Sehir
0      Mert    Cobanov          24     Bursa
1     Nilay     Mertal          22    Ankara
2  Dogancan  Mavideniz          24  Istanbul
3      Omer     Cengiz          23       NaN
4     Merve      Noyan  bilinmiyor     Izmir
5      Onur      Sahil          23  Istanbul

In [60]:
df_3 = df_2.copy()

In [61]:
df_3

       İsim      Soyad         Yas     Sehir
0      Mert    Cobanov          24     Bursa
1     Nilay     Mertal          22    Ankara
2  Dogancan  Mavideniz          24  Istanbul
3      Omer     Cengiz          23       NaN
4     Merve      Noyan  bilinmiyor     Izmir
5      Onur      Sahil          23  Istanbul

In [65]:
df_2["Yas"].replace("bilinmiyor", np.nan, inplace = True) #bilinmiyor hücresini kalıcı olarak nan yaptım.

In [73]:
df_2['Yas'].fillna(value = df_2['Yas'].mean(), inplace = True) #df_2 adlı veriçerçevesindeki 'Yaş' kolonundaki değerlerin ortalamasını Nan veriye ata.

In [74]:
df_2["Yas"]

0    24.0
1    22.0
2    24.0
3    23.0
4    23.2
5    23.0
Name: Yas, dtype: float64

In [75]:
import numpy as np
from sklearn.impute import SimpleImputer

In [79]:
#df_2 nin yedeğini df_3 olarak almıştık.
df_3['Yas'].replace("bilinmiyor", np.nan, inplace = True)

In [80]:
df_3

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0       NaN
4     Merve      Noyan   NaN     Izmir
5      Onur      Sahil  23.0  Istanbul

In [81]:
imp_freq = SimpleImputer(missing_values = np.nan, strategy = "most_frequent")
#en çok tekrar eden değer ile nan veriyi doldur.
df_3['Yas'] = imp_freq.fit_transform(df_3[['Yas']])
#df_3 yas kolonuna imp_freq adlı instanceımızı(durumumuzu) sklearn işlemi olan
#fit_transform ile df_3 ün yas kolonuna uyguluyoruz.

In [82]:
df_3

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0       NaN
4     Merve      Noyan  23.0     Izmir
5      Onur      Sahil  23.0  Istanbul

In [83]:
# Enterpolasyon
#pandas serisi oluşturalım,
s = pd.Series([0, 1, np.nan, 3])
print(s)

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [84]:
s.interpolate()#interpolasyon tekniği ile eksik veriyi bana gösteriyor.

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [85]:
from sklearn.impute import KNNImputer

In [86]:
X = [[1, 2, np.nan], [3, 4, 3], [np.nan, 6, 5], [8, 8, 7]]
#3x4 lük bir matris aldık.

In [87]:
pd.DataFrame(X)#dataframe ile daha güzel görünmesini sağlayalım.

     0  1    2
0  1.0  2  NaN
1  3.0  4  3.0
2  NaN  6  5.0
3  8.0  8  7.0

In [89]:
#KNN imputer objesinden birtane instance yaratıyorum.
imputer = KNNImputer(n_neighbors = 2, weights = 'uniform')
X = imputer.fit_transform(X)
#Komşularına göre ağırlıklarına bakarak Euclidian Distance'ını hesaplıyor
#ve bu eksik olan verinizi bu şekilde toparlayabiliyorsunuz.

In [90]:
pd.DataFrame(X)

     0    1    2
0  1.0  2.0  4.0
1  3.0  4.0  3.0
2  5.5  6.0  5.0
3  8.0  8.0  7.0

In [91]:
df_3

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0       NaN
4     Merve      Noyan  23.0     Izmir
5      Onur      Sahil  23.0  Istanbul

In [92]:
df_3["Sehir"] = df["Sehir"].replace(np.nan, "Diger")

In [93]:
df_3

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0     Diger
4     Merve      Noyan  23.0     Izmir
5      Onur      Sahil  23.0  Istanbul

In [ ]:
#Machine Learning algoritmaları kullanırken veride bir standartizasyona gitmemiz
#gerekebilir çünkü verinin bir tarafa yatıklığı çok fazla olabilir
#Karar ağaçları gibi yapıları kullanırken standartizasyon işlemi yapmak önemli,
#standatizasyon işleminden kastımız ortalaması "0" ve standart sapması "1" olacak şekilde
#ml algoritmalarında veriyi daha iyi kavraması için güzel istatistiksel işlemlerden birtanesidir

#Aşırı sapan değerlere outlayer değer diyoruz.

In [102]:
#Standart scaler işlemi
#Bir kolondaki dağılımın ortalaması '0' ve standart sapması '1' olacak
#şekilde yeniden scale etme işlemine denir.

In [119]:
from sklearn.preprocessing import StandardScaler
import numpy as np

In [120]:
df_ss = df_2.copy()

In [124]:
df_ss['Yas_Scaled'] = StandardScaler().fit_transform(df_ss[['Yas']])

In [122]:
df_ss['Yas'] #dağılımı standart dağılıma çevirip "Yas_Scaled" adlı yeni bir kolona aktarıyorum.

0    24.0
1    22.0
2    24.0
3    23.0
4    23.2
5    23.0
Name: Yas, dtype: float64

In [125]:
df_ss

       İsim      Soyad   Yas     Sehir  Yas_Scaled
0      Mert    Cobanov  24.0     Bursa     1.17108
1     Nilay     Mertal  22.0    Ankara    -1.75662
2  Dogancan  Mavideniz  24.0  Istanbul     1.17108
3      Omer     Cengiz  23.0       NaN    -0.29277
4     Merve      Noyan  23.2     Izmir     0.00000
5      Onur      Sahil  23.0  Istanbul    -0.29277

In [131]:
print(df_ss["Yas"].mean(axis = 0))
print(df_ss["Yas"].std(axis = 0))

23.2
0.7483314773547882

In [133]:
print(df_ss['Yas_Scaled'].mean(axis = 0))
print(df_ss['Yas_Scaled'].std(axis = 0))
#Bizim için bu veriyi standart dağılıma çevirmiş oluyor.

8.881784197001252e-16
1.0954451150103324

# MinMaxScaler

In [134]:
from sklearn.preprocessing import MinMaxScaler

In [135]:
df_mm = df_2.copy()

In [136]:
df_mm

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0       NaN
4     Merve      Noyan  23.2     Izmir
5      Onur      Sahil  23.0  Istanbul

In [139]:
df_mm['Yas_Scaled'] = MinMaxScaler().fit_transform(df_mm[['Yas']])

In [140]:
df_mm#Yaşı scale etmiş oldum.

       İsim      Soyad   Yas     Sehir  Yas_Scaled
0      Mert    Cobanov  24.0     Bursa         1.0
1     Nilay     Mertal  22.0    Ankara         0.0
2  Dogancan  Mavideniz  24.0  Istanbul         1.0
3      Omer     Cengiz  23.0       NaN         0.5
4     Merve      Noyan  23.2     Izmir         0.6
5      Onur      Sahil  23.0  Istanbul         0.5

In [141]:
df_ss#Genellikle machine learning algoritmaları dataframe'inizin
#sayı formatında olmasını ister
#bizim burada encoding işlemi yapmamız gerekiyor
#iki temel encoding işlemi vardır.
#label encoding ve one-hot-encoding
#label encoding : bir kolondaki tekel olan değerlerin bir sayıyla ifade edilmesi
#örn : Bursa = 0, Ankara = 1, İstanbul = 2, İzmir = 3

       İsim      Soyad   Yas     Sehir  Yas_Scaled
0      Mert    Cobanov  24.0     Bursa     1.17108
1     Nilay     Mertal  22.0    Ankara    -1.75662
2  Dogancan  Mavideniz  24.0  Istanbul     1.17108
3      Omer     Cengiz  23.0       NaN    -0.29277
4     Merve      Noyan  23.2     Izmir     0.00000
5      Onur      Sahil  23.0  Istanbul    -0.29277

# Label encoding

In [150]:
from sklearn.preprocessing import LabelEncoder

In [151]:
le = LabelEncoder()

In [171]:
df_le = df_3.copy()

In [172]:
df_le

       İsim      Soyad   Yas     Sehir
0      Mert    Cobanov  24.0     Bursa
1     Nilay     Mertal  22.0    Ankara
2  Dogancan  Mavideniz  24.0  Istanbul
3      Omer     Cengiz  23.0     Diger
4     Merve      Noyan  23.0     Izmir
5      Onur      Sahil  23.0  Istanbul

In [173]:
le.fit(df_le['Sehir'])

LabelEncoder()

In [174]:
list(le.classes_)#Ankara = 0, Bursa = 1, Diger = 2, Istanbul = 3, Izmır = 4

['Ankara', 'Bursa', 'Diger', 'Istanbul', 'Izmir']

In [175]:
df_le['Sehir'] = le.transform(df_le['Sehir'])#fit'i ve transform'u ayrı yapmak train ve
#test setindeki değişiklikleri çok fazla etkiliyormuş olacak.

In [176]:
df_le

       İsim      Soyad   Yas  Sehir
0      Mert    Cobanov  24.0      1
1     Nilay     Mertal  22.0      0
2  Dogancan  Mavideniz  24.0      3
3      Omer     Cengiz  23.0      2
4     Merve      Noyan  23.0      4
5      Onur      Sahil  23.0      3

In [177]:
#Inverse transform işlemi
le.inverse_transform([2, 1, 0, 1])

array(['Diger', 'Bursa', 'Ankara', 'Bursa'], dtype=object)

In [178]:
#Elimizde çok fazla veri var ve bu veriler kategorik,
#Bu sayıların değeri arttıkça bu kategorik değişkenin ağırlığı sorun olacaktır.
#Bu sebeple one-hot-encoding işlemi kullanacağız.
#5 uzunluğunda bir vektör yapıyoruz.
#herbir one-hot bir vektör olarak düşünelim.

pd.get_dummies(df_2['Sehir'])

   Ankara  Bursa  Istanbul  Izmir
0       0      1         0      0
1       1      0         0      0
2       0      0         1      0
3       0      0         0      0
4       0      0         0      1
5       0      0         1      0

In [180]:
X = np.array([[ -3., 5., 15 ],
              [  0., 6., 14 ],
              [  6., 3., 11 ]])

In [181]:
from sklearn import preprocessing

In [182]:
preprocessing.KBinsDiscretizer(n_bins = [3, 2, 2], encode = "ordinal").fit_transform(X)

array([[0., 1., 1.],
       [1., 1., 1.],
       [2., 0., 0.]])

In [183]:
binarizer = preprocessing.Binarizer(threshold = 1.1)

In [184]:
binarizer.transform(X)#1.1 değerinin üzerindeki bütün değerleri "1"
#1.1 altındaki değerleri

array([[0., 1., 1.],
       [0., 1., 1.],
       [1., 1., 1.]])